{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"d6fd7677-4849-5c08-b0a5-a621acf7a66b","excerpt":"Alhamdulillah kelar juga nih blog (belum kelar pake banget juga sih), sebelumnya udah pernah mainan dengan gatsby v1, kalo ditanya\nbedanya apa kalo di gatsby v2 yang saya tahu cuman kalo di gatsby 1 ada magic untuk wrap component dengan  layout-nya…","frontmatter":{"date":"March 14, 2019","title":"Membuat Static Site Dengan Menggunakan Gatsby js","image":null},"fields":{"path":"/playground/gatsby/"},"html":"<p>Alhamdulillah kelar juga nih blog (belum kelar pake banget juga sih), sebelumnya udah pernah mainan dengan gatsby v1, kalo ditanya\nbedanya apa kalo di gatsby v2 yang saya tahu cuman kalo di gatsby 1 ada magic untuk wrap component dengan <a href=\"https://www.gatsbyjs.org/docs/layout-components/#how-to-prevent-layout-components-from-unmounting\">layout-nya</a> dan ada StaticQuery untuk query data untuk component yang bukan page.</p>\n<p>Untuk style saya gunakan <a href=\"https://rebassjs.org/\">Rebass</a> yang dibuat oleh <a href=\"https://github.com/jxnblk\">jxnblk alias Brent Jackson</a>, sempat lihat di timeline twitter om Jackson ini baru-baru ini direkrut oleh gatsby (omedetou selamat om!! hilih makin oot) yang saya suka sebenarnya karena konsep core <a href=\"https://github.com/styled-system/styled-system\">styled-system</a>-nya bikin paradigma beripikir kita tentang styling itu dianggap sebagai box / kotak kecil.</p>\n<p>untuk plugin dan extra package yang saya pakai styled-component, remark-prismjs, transformer-remark, remark-responsive-iframe untuk handle iframe di page yang digenerate melalu markdown biar responsive bin elastis bin proporsional, ada juga plugin twitter supaya link yang saya masukkan jadi twitter card, react helmet untuk handle document head, saat ini saya juga pakai react responsive untuk handle responsive. Link googling sendiri ya.</p>\n<p>oh ya tidak lupa saya ucapkan kepada paman larry alias <a href=\"https://www.linkedin.com/in/adith-widya-pradipta-3a777894/\">Adith</a> yang udah saya tanya terkait dengan styling... u know.. css is scary.. :ghost:</p>\n<p align=\"center\">\n  <a href=\"https://me.me/i/what-is-a-backend-developer-backend-developer-it-mean-he-7dbe83e26f414035993a22bf279de60f\">\n    <image width=\"100%\" src=\"https://pics.me.me/what-is-a-backend-developer-backend-developer-it-mean-he-41886990.png\" />\n  </a>\n</p>"}},{"node":{"id":"6679a6e7-6ff7-5bf5-86ae-3e00b9fc1e7d","excerpt":"Artikel ini ketika dibuat sempat terpotong 2-3 bulan besar kemungkinan ada kesalahan. Maka saya semakin tidak bertanggung jawab bila database anda hilang, malfunction, atau dicomot kucing. Sering dapat notifikasi cinta dari om Zorin bahwa direktori…","frontmatter":{"date":"September 21, 2017","title":"Memindahkan Penyimpanan Database Postgre Ke Direktori Lain","image":null},"fields":{"path":"/playground/memindahkan-penyimpanan-database-psql/"},"html":"<blockquote>\n<p>Artikel ini ketika dibuat sempat terpotong 2-3 bulan besar kemungkinan ada kesalahan. Maka saya semakin tidak bertanggung jawab bila database anda hilang, malfunction, atau dicomot kucing.</p>\n</blockquote>\n<p>Sering dapat notifikasi cinta dari om Zorin bahwa direktori root di notebook kantor udah sekarat, ternyata gemuk karena image docker dan postgresql (psql) image docker 15 GB dan psql yang mencapai 30 GB. Image docker tanpa pikir panjang langsung hapus, sebenarnya lumayan sih langsung ada space sekitar 17 GB, tapi penasaran ternyata data psql bisa dipindahkan, nah kebetulan yang bikin nih root sempit karena hdd yang dijadikan root itu SSD 100 GB hasil bagi-bagi, root dapat jatah 67 GB, jadi rencananya mau bikin 1 partisi lagi yang diambil dari hdd yang lain (non SSD 1 TB), karena data psql ini aslinya udah jarang dipake, nampaknya tak masalah jika saya pindahkan ke non ssd.</p>\n<p>Yang akan dipelajari:</p>\n<ol>\n<li>Konfigurasi psql.</li>\n<li>Konfigurasi auto mount partisi menggunakan fstab.</li>\n</ol>\n<p>Yang perlu dipersiapkan:</p>\n<ol>\n<li>Partisi linux (saya menggunakan ext4).</li>\n<li>Mengetahui lokasi default data psql.</li>\n</ol>\n<p>Langkah-langkah:</p>\n<ol>\n<li>\n<p>Masuk ke psql command line</p>\n<p><code>sudo -u postgres psql</code></p>\n</li>\n<li>\n<p>Lalu gunakan command di bawah ini untuk mengetahui lokasi default data postgre anda, bila sudah ketik <code>\\q</code> untuk keluar dari cli-nya postgre</p>\n<p><code>SHOW data_directory;</code></p>\n<pre><code class=\"language-bash\">    data_directory\n------------------------------\n/var/lib/postgresql/9.5/main\n(1 row)\n</code></pre>\n</li>\n<li>\n<p>Matikan service postgre anda</p>\n<p><code>sudo systemctl stop postgresql</code></p>\n</li>\n<li>\n<p>Buat <em>mount point</em></p>\n<p><code>sudo mkdir /media/data</code></p>\n</li>\n<li>\n<p>Catat uuid pada partisi yang akan anda gunakan</p>\n<p><code>sudo blkid</code></p>\n</li>\n<li>\n<p>Gunakan editor favorit anda untuk mengubah file /etc/fstab, gunakan uuid yang didapat pada langkah sebelumnya</p>\n<p><code>sudo vim /etc/fstab</code>\n<code>UUID=0f713ecd-564f-4a14-868b-2aefe36ed2dc /media/data ext4 defaults 0 2</code></p>\n</li>\n<li>\n<p>Pastikan partisi baru anda bisa digunakan, bila sudah salin folder postgre ke partisi yang baru saja dibuat</p>\n<p><code>sudo rsync -av /var/lib/postgresql /media/data/psql</code></p>\n</li>\n<li>\n<p>Bila sudah selesai backup database</p>\n<p><code>sudo mv /var/lib/postgresql/9.5/main /var/lib/postgresql/9.5/main.bak</code></p>\n</li>\n<li>\n<p>Lalu ke configurasi postgre ubah nilah data_directory\n<code>sudo vim /etc/postgresql/9.5/main/postgresql.conf</code></p>\n<p><code>data_directory = '/media/data/psql/postgresql/9.5/main'</code></p>\n</li>\n<li>\n<p>Hidupkan kembali postgre service</p>\n<p><code>sudo systemctl start postgresql</code></p>\n</li>\n<li>\n<p>Gunakan langkah no.2 untuk cek kembali apakah data_directory sudah mengarah ke partisi baru</p>\n</li>\n</ol>\n<p>Bila iya bisa restart kembali postgre service-nya untuk memastikan.</p>\n<p>Edit:\nBaca ulang ternyata kurang referensi:\n<a href=\"https://www.digitalocean.com/community/tutorials/how-to-move-a-postgresql-data-directory-to-a-new-location-on-ubuntu-16-04\">digital ocean</a></p>"}},{"node":{"id":"7cd40f17-a162-59b5-b9a1-77629a4100cf","excerpt":"Yap series Sora yori mo Tooi Basho (SYMTB) sudah berakhir, buat yang pernah mengikuti K-on serial ini cukup familiar menghadirkan empat main heroine, tapi ini berbeda dengan slice of life pada umumnya yang main plot lebih di sekolah, pada serial…","frontmatter":{"date":"September 21, 2017","title":"Sora yori mo Tooi Basho","image":{"src":"https://m.media-amazon.com/images/M/MV5BYTNhNTFjZGYtNjFlMC00N2RmLTkxOWEtNDc5OWE2OGIxMDExXkEyXkFqcGdeQXVyNjc3OTE4Nzk@._V1_.jpg","caption":"Photo from IMDB","captionUrl":"https://www.imdb.com/title/tt7836688/"}},"fields":{"path":"/anime/sora-yori-tooi-basho/"},"html":"<p>Yap series Sora yori mo Tooi Basho (SYMTB) sudah berakhir, buat yang pernah mengikuti K-on serial ini cukup familiar menghadirkan empat main heroine, tapi ini berbeda dengan slice of life pada umumnya yang main plot lebih di sekolah, pada serial SYMTB ini mengisahkan usaha kelompok sahabat ini untuk ke Antartika</p>\n<p>Kisah ini sendiri  dimulai dari seorang siswi SMA Shirase Kobuchizawa yang bekerja keras untuk mendapatkan uang yang banyak agar bisa pergi ke Antartika. Usaha untuk mewujudkan mimpinya ini tidak mudah karena dia mengalami cobaan seperti, ejekan, sindiran dan lain-lain karena mimpinya itu bisa dibilang mustahil. Motivasi Shirase sendiri karena ingin \"menemui\" ibunya yang hilang pada ekxpedisi sebelumnya, melalui buku yang ditulis oleh ibunya yang berjudul \"Tempat terjauh Daripada Alam Semesta\".</p>\n<p>Yang menarik dari kisah ini karena original =P, seperti yang digambarkan di atas kisah ini menitikberatkan pada persahabatan, dan masing-masing dari mereka mempunyai alasan sendiri untuk pergi ke antartika, Mari yang gak mau \"lepas\" masa mudanya dengan hal yang membosankan, Hinata yang karena \"yah gw pengen\" =P, Yuzuki yang tidak nyaman dengan status \"Selebgram\" yang justru ke Antartika karena ingin mendatkan sahabat, dan terakhir Shirase yang ingin mencari tahu tentang ibunya</p>\n<p>Untuk animasi-nya buat saya pribadi sudah cukup, dan peran para masing-masing <em>seiyuu</em> cukup baik memerankan tiap char. Sound juga menarik, untuk lagu ED pun yang dinyanyikan oleh para masing-masing <em>seiyuu</em> juga enak dan semakin menambah chemistry hubungan tiap char. Buat yang pingin dapat cerita slice of life meskipun memang \"membosankan\" menurut saya yang memang tidak terlalu suka slice of life cukup banyak menambah inspirasi, bagaimana cara mereka mewujudkan keinginan mereka untuk pergi ke Antartika. </p>\n<p>Secara keseluruhan saya nilai 8.5/10</p>"}},{"node":{"id":"5f6f1f36-4701-5801-bfa2-9f9c882fb972","excerpt":"Konfigurasi di os linux dan mac os umumnya disimpan dalam bentuk hidden files atau biasa disebut dengan dotfiles contoh .vimrc untuk vim .zshrc untuk zsh dll. Ada baiknya dotfiles ini dibackup karena apabila kita berganti device atau mengganti os…","frontmatter":{"date":"August 27, 2017","title":"Mengelola Dotfiles","image":{"src":null,"caption":null,"captionUrl":null}},"fields":{"path":"/playground/mengelola-dotfiles/"},"html":"<p>Konfigurasi di os linux dan mac os umumnya disimpan dalam bentuk hidden files atau biasa disebut dengan dotfiles contoh .vimrc untuk vim .zshrc untuk zsh dll. Ada baiknya dotfiles ini dibackup karena apabila kita berganti device atau mengganti os file-file konfigurasi yang dulu kita gunakan bisa kita gunakan kembali.</p>\n<p>Yang perlu disiapkan:</p>\n<ol>\n<li>Niat</li>\n<li>Git</li>\n<li>Akun di repository management services misal <a href=\"https://github.com\">Github</a>, <a href=\"https://gitlab.com\">Gitlab</a>, atau <a href=\"https://bitbucket.org\">Bitbucket</a></li>\n</ol>\n<p>Yang perlu diperhatikan Karena metode yang digunakan ini menyimpan konfigurasi kita di repository management service terlebih jika kita beri akses publik mohon untuk tidak menyimpan file-file ini dalam git anda:</p>\n<ol>\n<li>File yang sifatnya credential, misal private key, .aws dll</li>\n<li>File yang sifatnya rahasia .slip<em>gaji, .list</em>mantan, .berat<em>badan .belanjaan</em>istri dll</li>\n</ol>\n<p>Cara yang digunakan ini merunut pada <a href=\"https://github.com/jaagr/dots\">jaagr</a> karena gak perlu symlink, copy atau semacamnya.</p>\n<p>Berikut langkah langkahnya</p>\n<ol>\n<li><code>alias dots='git –git-dir=$HOME/.dots.git/ –work-tree=$HOME</code>\nBuat alias di shell kesayangan anda .zshrc atau .bashrc, yang fungsinya ialah membuat command dots yang mengeksekusi command git yang selalu merujuk direktori .dots.git (yang nanti akan kita buat) dengan working space yang digunakan direktori user home anda, jangan lupa untuk merefresh shell anda</li>\n<li><code>git init –bare $HOME/.dots.git</code>\ndots remote add origin ${dots<em>repo</em>anda}\nfungsinya ialah membuat direktori git dengan nama .dots.git di direktori home user anda dan menambahkan remote repo anda</li>\n<li><code>dots config status.showUntrackedFiles no</code>\nBuat alias\n<code>dots config alias.untracked “status -u .”</code>\n<code>dots config alias.untracked-at “status -u”</code>\nfungsinya ialah agar tidak menampilkan untracked file pada direktori $HOME yang kita gunakan sebagai work-tree, dan membuat alias baru untuk menampilkan untracked files</li>\n<li>\n<p>Gunakan alias dots seperti anda menggunakan command git</p>\n<pre><code class=\"language-bash\">dots status dots add -u\ndots commit -m “…“\ndots push\nList file yang tidak dipantau oleh git\ndots untracked\ndots status -u .config/\nList file yang ditracked oleh git\ndots ls-files\ndots ls-files .config/polybar/\n</code></pre>\n</li>\n</ol>"}},{"node":{"id":"543f68d5-f462-58b2-8f28-9e20e72bcd94","excerpt":"'Bisa karena terbiasa', karena terbiasa ini menjadi sebuah kebiasaan lalu menjadi sebuah rutinitas. Kebiasaan atau bahasa gaulnya habit yang bila mengacu pada kbbi  ialah: Pola untuk melakukan tanggapan thd situasi tertentu yg dipelajari oleh seorang…","frontmatter":{"date":"April 17, 2017","title":"Habit","image":{"src":null,"caption":null,"captionUrl":null}},"fields":{"path":"/lifehack/habit/"},"html":"<p>'Bisa karena terbiasa', karena terbiasa ini menjadi sebuah kebiasaan lalu menjadi sebuah rutinitas. Kebiasaan atau bahasa gaulnya habit yang bila mengacu pada kbbi<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> ialah:</p>\n<blockquote>\n<p>Pola untuk melakukan tanggapan thd situasi tertentu yg dipelajari oleh seorang individu dan yg dilakukannya secara berulang untuk hal yg sama'.</p>\n</blockquote>\n<p>Bicara <em>habit</em> karena ini terkait dengan proses belajar, saya teringat dengan video yang diperlihatkan kepada saya tentang proses otak ketika mempelajari sesuatu yang baru, bila dianalogikan seperti kita membuat jembatan tali yang menghubungkan antar tebing. Pada tahapan awal tersulit yaitu ketika menyebrang ke tebing yang lain bergelantungan dengan tali. Setelah sampai di sisi sebarang kita mengaitkan kembali tali, dengan tail yang semakin kuat dan kokoh kita dapat berjalan di atas tali, selanjutnya dibuat simpul-simpul sehingga tali semakin kuat dan kokoh, tahapan terakhir memasang papan sebagai alas jembatan sehingga kita semakin mudah menyeberang antar tebing tersebut <sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>.</p>\n<p>Belajar dari ilustrasi tersebut untuk membangun sebuah kebiasaan sangat sulit di awal, namun bila sudah jadi kebiasaan selanjutnya akan lebih mudah. Terkait dengan habit MPJ pada video di bawah ini akan menjelaskan tentang habit. </p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/kI5FYpwZMXU\" frameborder=\"0\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p><a href=\"http://kbbi.web.id/biasa\">kbbi</a></p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p><a href=\"http://learningandtheadolescentmind.org/resources_02_learning.html\">http://learningandtheadolescentmind.org</a></p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>"}},{"node":{"id":"b9059b44-5dc6-59bf-bc12-0cf8e3ba612c","excerpt":"Sudah seminggu kabar ini beredar dan hasil pertandingan Leicester terakhir pasca dipecatnya\nRanieri adalah 3-1 melawan Liverpool. Tapi berbagai tribute untuk Ranieri masih mengalir.\nThanks coach, pelatih yang berhasil menjuarai EPL, the phenomenon…","frontmatter":{"date":"March 02, 2017","title":"Selintas Tweet: Ranieri by Detik.com","image":{"src":null,"caption":null,"captionUrl":null}},"fields":{"path":"/lifehack/ranieri/"},"html":"<blockquote class=\"twitter-tweet\"><p lang=\"in\" dir=\"ltr\">Pecat Ranieri, Leicester Beralasan Butuh Perubahan demi Menghindari Degradasi <a href=\"https://t.co/Y9cc183zEk\">https://t.co/Y9cc183zEk</a> via <a href=\"https://twitter.com/detiksport?ref_src=twsrc%5Etfw\">@detiksport</a> <a href=\"https://t.co/xIGNXAqlbx\">pic.twitter.com/xIGNXAqlbx</a></p>&mdash; detikcom (@detikcom) <a href=\"https://twitter.com/detikcom/status/834874442199097344?ref_src=twsrc%5Etfw\">February 23, 2017</a></blockquote>\n<p>Sudah seminggu kabar ini beredar dan hasil pertandingan Leicester terakhir pasca dipecatnya\nRanieri adalah 3-1 melawan Liverpool. Tapi berbagai tribute untuk Ranieri masih mengalir.\nThanks coach, pelatih yang berhasil menjuarai EPL, the phenomenon, seingat saya Ranieri ini\ndikenal sebagai spesialis juara 2, tapi berhasil menjuarai EPL, gelar yang didambakan Liverpool\nselama 10 tahun lebih, gelar yang juga didambakan oleh para pendukung MU pasca rezim Fergie,\ngelar yang pula didambakan Arsenal pasca unbeaten record mereka. Kerasnya liga inggris dengan\nhanya menang 5 kali seri 6 dan kalah sebanyak 14 kali dari 25 kali pertandingan di EPL, dan bertengger\nbeberapa strip dengan zona degradasi memaksa manajemen mengambil keputusan sulit untuk merumahkan\nRanieri. Hasil fantastis musim lalu seolah terlupakan dengan hasil kurang meyakinkan di musim ini.\nMemang baiknya Manajemen Leicester, squad dan fans mesti belajar dari sebuah negeri dimana\npemimpinnya begitu dinabikan, meskipun sudah berstatus terdakwa masih dapat menikmati jok empuk mobil\norang nomor satu di negeri tersebut sembari cengar cengir dan cengengesan, tak peduli tabiatnya akan\nmembawa degradasi moral, nilai kemanusiaan dan persatuan di negeri itu. Memang benar kata mbah</p>\n<blockquote>\n<p>Pemimpin bertangan besi mematikan nyali, pemimpin yang dinabikan mematikan nalar.</p>\n</blockquote>\n<p>Sudah nyalinya mati, nalarnya ikutan mati.</p>"}}]}},"pageContext":{}}