{"data":{"site":{"siteMetadata":{"host":"detikpw.github.io"}},"markdownRemark":{"html":"<blockquote class=\"twitter-tweet\"><p lang=\"in\" dir=\"ltr\">Pecat Ranieri, Leicester Beralasan Butuh Perubahan demi Menghindari Degradasi <a href=\"https://t.co/Y9cc183zEk\">https://t.co/Y9cc183zEk</a> via <a href=\"https://twitter.com/detiksport?ref_src=twsrc%5Etfw\">@detiksport</a> <a href=\"https://t.co/xIGNXAqlbx\">pic.twitter.com/xIGNXAqlbx</a></p>&mdash; detikcom (@detikcom) <a href=\"https://twitter.com/detikcom/status/834874442199097344?ref_src=twsrc%5Etfw\">February 23, 2017</a></blockquote>\n<p>Sudah seminggu kabar ini beredar dan hasil pertandingan Leicester terakhir pasca dipecatnya\nRanieri adalah 3-1 melawan Liverpool. Tapi berbagai tribute untuk Ranieri masih mengalir.\nThanks coach, pelatih yang berhasil menjuarai EPL, the phenomenon, seingat saya Ranieri ini\ndikenal sebagai spesialis juara 2, tapi berhasil menjuarai EPL, gelar yang didambakan Liverpool\nselama 10 tahun lebih, gelar yang juga didambakan oleh para pendukung MU pasca rezim Fergie,\ngelar yang pula didambakan Arsenal pasca unbeaten record mereka. Kerasnya liga inggris dengan\nhanya menang 5 kali seri 6 dan kalah sebanyak 14 kali dari 25 kali pertandingan di EPL, dan bertengger\nbeberapa strip dengan zona degradasi memaksa manajemen mengambil keputusan sulit untuk merumahkan\nRanieri. Hasil fantastis musim lalu seolah terlupakan dengan hasil kurang meyakinkan di musim ini.\nMemang baiknya Manajemen Leicester, squad dan fans mesti belajar dari sebuah negeri dimana\npemimpinnya begitu dinabikan, meskipun sudah berstatus terdakwa masih dapat menikmati jok empuk mobil\norang nomor satu di negeri tersebut sembari cengar cengir dan cengengesan, tak peduli tabiatnya akan\nmembawa degradasi moral, nilai kemanusiaan dan persatuan di negeri itu. Memang benar kata mbah</p>\n<blockquote>\n<p>Pemimpin bertangan besi mematikan nyali, pemimpin yang dinabikan mematikan nalar.</p>\n</blockquote>\n<p>Sudah nyalinya mati, nalarnya ikutan mati.</p>","timeToRead":1,"excerpt":"Sudah seminggu kabar ini beredar dan hasil pertandingan Leicester terakhir pasca dipecatnya\nRanieri adalah 3-1 melawan Liverpool. Tapi berbagai tribute untuk Ranieri masih mengalir.\nThanks coach, pelatih yang berhasil menjuarai EPL, the phenomenon…","frontmatter":{"date":"March 02, 2017","title":"Selintas Tweet: Ranieri by Detik.com","topic":null,"tags":["sepakbola","EPL"],"image":{"src":null,"url":null,"caption":null,"captionUrl":null}}}},"pageContext":{"pathName":"/lifehack/ranieri/"}}