{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"a45f8c73-441e-57a7-8eaa-0814742109c1","excerpt":"Beberapa waktu lalu pernah coba tranfer ke gopay pakai ovo, saya sudah soba VA BNI dan BCA, dua-duanya gagal, dan yang saya ingat va BNI itu bisa transfer dari bank selain BNI (shopee), tapi ternyata memang tidak bisa, eh iseng karena kepepet mau isi…","frontmatter":{"date":"March 18, 2019","title":"[TIL] Cara Isi a.k.a Top Up Gopay dengan Menggunakan Ovo","image":{"src":"https://images.unsplash.com/photo-1518674660708-0e2c0473e68e?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1567&q=80","caption":"Photo by Art Lasovsky","captionUrl":"https://unsplash.com/@artlasovsky"}},"fields":{"path":"/lifehack/gopay-ovo/"},"html":"<p>Beberapa waktu lalu pernah coba tranfer ke gopay pakai ovo, saya sudah soba VA BNI dan BCA, dua-duanya gagal, dan yang saya ingat va BNI itu bisa transfer dari bank selain BNI (shopee), tapi ternyata memang tidak bisa, eh iseng karena kepepet mau isi gopay teman habis bayar makan, googling ternyata bisa melalu VA bank permata, caranya simple transfer pilih bank permata ke 898<Nomor hp> voila keluar nama sang target tinggal transfer deh. Biaya tranfernya gratis, dan sepertinya ini hanya berlaku untuk pelanggan ovo permier btw ini sumber <a href=\"https://refrez.com/blog/tech/cara-isi-saldo-gopay-dana-dari-ovo.html\" target=\"_blank\" rel=\"nofollow\">informasinya</a>  di blog itu juga diberi tahu cara top up dana menggunakan Ovo.</p>"}},{"node":{"id":"543f68d5-f462-58b2-8f28-9e20e72bcd94","excerpt":"'Bisa karena terbiasa', karena terbiasa ini menjadi sebuah kebiasaan lalu menjadi sebuah rutinitas. Kebiasaan atau bahasa gaulnya habit yang bila mengacu pada kbbi  ialah: Pola untuk melakukan tanggapan thd situasi tertentu yg dipelajari oleh seorang…","frontmatter":{"date":"April 17, 2017","title":"Habit","image":{"src":null,"caption":null,"captionUrl":null}},"fields":{"path":"/lifehack/habit/"},"html":"<p>'Bisa karena terbiasa', karena terbiasa ini menjadi sebuah kebiasaan lalu menjadi sebuah rutinitas. Kebiasaan atau bahasa gaulnya habit yang bila mengacu pada kbbi<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> ialah:</p>\n<blockquote>\n<p>Pola untuk melakukan tanggapan thd situasi tertentu yg dipelajari oleh seorang individu dan yg dilakukannya secara berulang untuk hal yg sama'.</p>\n</blockquote>\n<p>Bicara <em>habit</em> karena ini terkait dengan proses belajar, saya teringat dengan video yang diperlihatkan kepada saya tentang proses otak ketika mempelajari sesuatu yang baru, bila dianalogikan seperti kita membuat jembatan tali yang menghubungkan antar tebing. Pada tahapan awal tersulit yaitu ketika menyebrang ke tebing yang lain bergelantungan dengan tali. Setelah sampai di sisi sebarang kita mengaitkan kembali tali, dengan tail yang semakin kuat dan kokoh kita dapat berjalan di atas tali, selanjutnya dibuat simpul-simpul sehingga tali semakin kuat dan kokoh, tahapan terakhir memasang papan sebagai alas jembatan sehingga kita semakin mudah menyeberang antar tebing tersebut <sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>.</p>\n<p>Belajar dari ilustrasi tersebut untuk membangun sebuah kebiasaan sangat sulit di awal, namun bila sudah jadi kebiasaan selanjutnya akan lebih mudah. Terkait dengan habit MPJ pada video di bawah ini akan menjelaskan tentang habit. </p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/kI5FYpwZMXU\" frameborder=\"0\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p><a href=\"http://kbbi.web.id/biasa\" target=\"_blank\" rel=\"nofollow\">kbbi</a></p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p><a href=\"http://learningandtheadolescentmind.org/resources_02_learning.html\" target=\"_blank\" rel=\"nofollow\">http://learningandtheadolescentmind.org</a></p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>"}},{"node":{"id":"b9059b44-5dc6-59bf-bc12-0cf8e3ba612c","excerpt":"Sudah seminggu kabar ini beredar dan hasil pertandingan Leicester terakhir pasca dipecatnya\nRanieri adalah 3-1 melawan Liverpool. Tapi berbagai tribute untuk Ranieri masih mengalir.\nThanks coach, pelatih yang berhasil menjuarai EPL, the phenomenon…","frontmatter":{"date":"March 02, 2017","title":"Selintas Tweet: Ranieri by Detik.com","image":{"src":null,"caption":null,"captionUrl":null}},"fields":{"path":"/lifehack/ranieri/"},"html":"<blockquote class=\"twitter-tweet\"><p lang=\"in\" dir=\"ltr\">Pecat Ranieri, Leicester Beralasan Butuh Perubahan demi Menghindari Degradasi <a href=\"https://t.co/Y9cc183zEk\">https://t.co/Y9cc183zEk</a> via <a href=\"https://twitter.com/detiksport?ref_src=twsrc%5Etfw\">@detiksport</a> <a href=\"https://t.co/xIGNXAqlbx\">pic.twitter.com/xIGNXAqlbx</a></p>&mdash; detikcom (@detikcom) <a href=\"https://twitter.com/detikcom/status/834874442199097344?ref_src=twsrc%5Etfw\">February 23, 2017</a></blockquote>\n<p>Sudah seminggu kabar ini beredar dan hasil pertandingan Leicester terakhir pasca dipecatnya\nRanieri adalah 3-1 melawan Liverpool. Tapi berbagai tribute untuk Ranieri masih mengalir.\nThanks coach, pelatih yang berhasil menjuarai EPL, the phenomenon, seingat saya Ranieri ini\ndikenal sebagai spesialis juara 2, tapi berhasil menjuarai EPL, gelar yang didambakan Liverpool\nselama 10 tahun lebih, gelar yang juga didambakan oleh para pendukung MU pasca rezim Fergie,\ngelar yang pula didambakan Arsenal pasca unbeaten record mereka. Kerasnya liga inggris dengan\nhanya menang 5 kali seri 6 dan kalah sebanyak 14 kali dari 25 kali pertandingan di EPL, dan bertengger\nbeberapa strip dengan zona degradasi memaksa manajemen mengambil keputusan sulit untuk merumahkan\nRanieri. Hasil fantastis musim lalu seolah terlupakan dengan hasil kurang meyakinkan di musim ini.\nMemang baiknya Manajemen Leicester, squad dan fans mesti belajar dari sebuah negeri dimana\npemimpinnya begitu dinabikan, meskipun sudah berstatus terdakwa masih dapat menikmati jok empuk mobil\norang nomor satu di negeri tersebut sembari cengar cengir dan cengengesan, tak peduli tabiatnya akan\nmembawa degradasi moral, nilai kemanusiaan dan persatuan di negeri itu. Memang benar kata mbah</p>\n<blockquote>\n<p>Pemimpin bertangan besi mematikan nyali, pemimpin yang dinabikan mematikan nalar.</p>\n</blockquote>\n<p>Sudah nyalinya mati, nalarnya ikutan mati.</p>"}}]}},"pageContext":{"category":"lifehack"}}