{"data":{"site":{"siteMetadata":{"host":"https://detikpw.github.io"}},"markdownRemark":{"html":"<p>Alhamdulillah kelar juga nih blog (belum kelar pake banget juga sih), sebelumnya udah pernah mainan dengan gatsby v1, kalo ditanya\nbedanya apa kalo di gatsby v2 yang saya tahu cuman kalo di gatsby 1 ada magic untuk wrap component dengan <a href=\"https://www.gatsbyjs.org/docs/layout-components/#how-to-prevent-layout-components-from-unmounting\" target=\"_blank\" rel=\"nofollow\">layout-nya</a> dan ada StaticQuery untuk query data untuk component yang bukan page.</p>\n<p>Untuk style saya gunakan <a href=\"https://rebassjs.org/\" target=\"_blank\" rel=\"nofollow\">Rebass</a> yang dibuat oleh <a href=\"https://github.com/jxnblk\" target=\"_blank\" rel=\"nofollow\">jxnblk alias Brent Jackson</a>, sempat lihat di timeline twitter om Jackson ini baru-baru ini direkrut oleh gatsby (omedetou selamat om!! hilih makin oot) yang saya suka sebenarnya karena konsep core <a href=\"https://github.com/styled-system/styled-system\" target=\"_blank\" rel=\"nofollow\">styled-system</a>-nya bikin paradigma beripikir kita tentang styling itu dianggap sebagai box / kotak kecil.</p>\n<p>untuk plugin dan extra package yang saya pakai styled-component, remark-prismjs, transformer-remark, remark-responsive-iframe untuk handle iframe di page yang digenerate melalu markdown biar responsive bin elastis bin proporsional, ada juga plugin twitter supaya link yang saya masukkan jadi twitter card, react helmet untuk handle document head, saat ini saya juga pakai react responsive untuk handle responsive. Link googling sendiri ya.</p>\n<p>oh ya tidak lupa saya ucapkan terima kasih kepada paman larry alias <a href=\"https://www.linkedin.com/in/adith-widya-pradipta-3a777894/\" target=\"_blank\" rel=\"nofollow\">Adith</a> yang udah saya repotkan dengan pertanyaan terkait dengan styling... u know.. css is scary.. :ghost:</p>\n<p align=\"center\">\n  <a href=\"https://me.me/i/what-is-a-backend-developer-backend-developer-it-mean-he-7dbe83e26f414035993a22bf279de60f\">\n    <img width=\"100%\" src=\"https://pics.me.me/what-is-a-backend-developer-backend-developer-it-mean-he-41886990.png\">\n  </a>\n</p>","timeToRead":1,"excerpt":"Alhamdulillah kelar juga nih blog (belum kelar pake banget juga sih), sebelumnya udah pernah mainan dengan gatsby v1, kalo ditanya\nbedanya apa kalo di gatsby v2 yang saya tahu cuman kalo di gatsby 1 ada magic untuk wrap component dengan  layout-nya…","frontmatter":{"date":"March 14, 2019","title":"Membuat Static Site Dengan Menggunakan Gatsby js","topic":null,"tags":["gatsby","web development"],"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"pathname":"/playground/gatsby/"}}