{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"543f68d5-f462-58b2-8f28-9e20e72bcd94","excerpt":"'Bisa karena terbiasa', karena terbiasa ini menjadi sebuah kebiasaan lalu menjadi sebuah rutinitas. Kebiasaan atau bahasa gaulnya habit yang bila mengacu pada kbbi  ialah: Pola untuk melakukan tanggapan thd situasi tertentu yg dipelajari oleh seorang…","frontmatter":{"date":"April 17, 2017","title":"Habit","image":{"src":null,"caption":null,"captionUrl":null}},"fields":{"path":"/lifehack/habit/"},"html":"<p>'Bisa karena terbiasa', karena terbiasa ini menjadi sebuah kebiasaan lalu menjadi sebuah rutinitas. Kebiasaan atau bahasa gaulnya habit yang bila mengacu pada kbbi<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> ialah:</p>\n<blockquote>\n<p>Pola untuk melakukan tanggapan thd situasi tertentu yg dipelajari oleh seorang individu dan yg dilakukannya secara berulang untuk hal yg sama'.</p>\n</blockquote>\n<p>Bicara <em>habit</em> karena ini terkait dengan proses belajar, saya teringat dengan video yang diperlihatkan kepada saya tentang proses otak ketika mempelajari sesuatu yang baru, bila dianalogikan seperti kita membuat jembatan tali yang menghubungkan antar tebing. Pada tahapan awal tersulit yaitu ketika menyebrang ke tebing yang lain bergelantungan dengan tali. Setelah sampai di sisi sebarang kita mengaitkan kembali tali, dengan tail yang semakin kuat dan kokoh kita dapat berjalan di atas tali, selanjutnya dibuat simpul-simpul sehingga tali semakin kuat dan kokoh, tahapan terakhir memasang papan sebagai alas jembatan sehingga kita semakin mudah menyeberang antar tebing tersebut <sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>.</p>\n<p>Belajar dari ilustrasi tersebut untuk membangun sebuah kebiasaan sangat sulit di awal, namun bila sudah jadi kebiasaan selanjutnya akan lebih mudah. Terkait dengan habit MPJ pada video di bawah ini akan menjelaskan tentang habit. </p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/kI5FYpwZMXU\" frameborder=\"0\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p><a href=\"http://kbbi.web.id/biasa\" target=\"_blank\" rel=\"nofollow\">kbbi</a></p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p><a href=\"http://learningandtheadolescentmind.org/resources_02_learning.html\" target=\"_blank\" rel=\"nofollow\">http://learningandtheadolescentmind.org</a></p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>"}}]}},"pageContext":{"tag":"learning"}}